Documents/ПродажаРыб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПродажаРыб</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиРыб</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Рыбы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аквариум</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Аквариум</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПородаРыб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПородаРыб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиРыб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиРыб</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Аквариум</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аквариум</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПородаРыб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПородаРыб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПродажаРыб/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)		Движения.ОстаткиРыб.Записывать = Истина;		Для Каждого ТекСтрока Из Рыбы Цикл				Запрос = Новый Запрос;		Запрос.Текст = 			"ВЫБРАТЬ			|	ОстаткиРыбОстатки.КоличествоОстаток КАК КоличествоОстаток,			|	ОстаткиРыбОстатки.СуммаОстаток КАК СуммаОстаток			|ИЗ			|	РегистрНакопления.ОстаткиРыб.Остатки(&Период, Аквариум = &Аквариум И ПородаРыб = &ПородаРыб) КАК ОстаткиРыбОстатки";				Запрос.УстановитьПараметр("Период", МоментВремени());		Запрос.УстановитьПараметр("Аквариум", ТекСтрока.Аквариум);		Запрос.УстановитьПараметр("ПородаРыб", ТекСтрока.ПородаРыб);				РезультатЗапроса = Запрос.Выполнить();				ОстатокКоличество = 0;		ОстатокСумма = 0;				Если Не РезультатЗапроса.Пустой() Тогда			Выборка = РезультатЗапроса.Выбрать();			Выборка.Следующий();			ОстатокКоличество = Выборка.КоличествоОстаток;			ОстатокСумма  = Выборка.СуммаОстаток;		КонецЕсли;				Если ОстатокКоличество < ТекСтрока.Количество Тогда			Сообщить("Не хватает рыбы породе " + ТекСтрока.ПородаРыб + " в аквариуме " + ТекСтрока.Аквариум);			Сообщить("Требуется: " + ТекСтрока.Количество + ", В наличии: " + ОстатокКоличество);			Отказ = Истина;			Продолжить; 
		КонецЕсли;				Если ОстатокКоличество = ТекСтрока.Количество Тогда			СписываемаяСебестоимость = ОстатокСумма;		Иначе			СписываемаяСебестоимость = (ОстатокСумма / ОстатокКоличество) * ТекСтрока.Количество;		КонецЕсли;				НовоеДвижение = Движения.ОстаткиРыб.Добавить();		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход; 	
		НовоеДвижение.Период = Дата;		НовоеДвижение.Аквариум = ТекСтрока.Аквариум;		НовоеДвижение.ПородаРыб = ТекСтрока.ПородаРыб;				НовоеДвижение.Количество = ТекСтрока.Количество;        
		НовоеДвижение.Сумма  = СписываемаяСебестоимость;   			КонецЦикла;КонецПроцедуры
